app/Controllers/AdminControllers.php

    public function index()
    {
        $UsersModels = new UsersModels();
        $transaksi = new TransaksiModels();
        $menu = [
            'AdminDashboard' => 'dashboard',
            'RegisterUser' => '',
            'RegisterSupplier' => '',
            'DataKategoriBarang' => '',
            'DataKategoriPaket' => '',
            'DataBarang' => '',
            'MenuDataBarang' => '',
            'DataBarangSupplier' => '',
            'DataPackingBarang' => '',
            'DataPeriodeTransaksi' => '',
            'MenuDataTransaksi' => '',
            'DataPaketBarang' => '',
            'DataTransaksi' => '',
            'DataTransaksiCicilan' => '',
            'DataTransaksiLogCicilan' => '',
            'NotipDataTransaksi' => $transaksi->get_datatransaksi(),
            'NotipDataLogCicilan' => $transaksi->get_datatransaksi(),
            'NotipDataUser' => $UsersModels->findAll(),
---
SELECT *
FROM `tb_user`

    public function listdatatransaksi()
    {
        $UsersModels = new UsersModels();
        $paketbarang = new PaketBarangModels();
        $transaksi = new TransaksiModels();
        $data = [
            'AdminDashboard' => '',
            'RegisterUser' => '',
            'RegisterSupplier' => '',
            'DataKategoriBarang' => '',
            'DataBarang' => '',
            'DataBarangSupplier' => '',
            'DataPackingBarang' => '',
            'MenuDataBarang' => '',
            'DataPaketBarang' => '',
            'DataKategoriPaket' => '',
            'DataTransaksiCicilan' => '',
            'MenuDataTransaksi' => 'menudatatransaksi',
            'DataPeriodeTransaksi' => '',
            'DataTransaksi' => 'datatransaksi',
            'DataPaket' => $transaksi->datapaket(),
            'DataUser' => $transaksi->datauser(),
            'payperiode' => $paketbarang->datapayperiode(),
            'DataTransaksiLogCicilan' => '',
            'NotipDataTransaksi' => $transaksi->get_datatransaksi(),
            'NotipDataUser' => $UsersModels->findAll(),
            'NotipDataPaket' => $transaksi->datapaket(),


        ];
        $data['tb_transaksi'] = $transaksi->findAll();
---
SELECT *
FROM `tb_user`
SELECT *
FROM `tb_transaksi`

    public function editnoapprovedtransaksi($t_id)
    {
        $paketbarang = new PaketBarangModels();
        $transaksi = new TransaksiModels();
        $data = [
            'AdminDashboard' => '',
            'RegisterUser' => '',
            'RegisterSupplier' => '',
            'DataKategoriBarang' => '',
            'DataBarang' => '',
            'DataBarangSupplier' => '',
            'MenuDataBarang' => '',
            'DataPackingBarang' => '',
            'DataKategoriPaket' => '',
            'DataPaketBarang' => '',
            'MenuDataTransaksi' => 'menudatatransaksi',
            'DataPeriodeTransaksi' => '',
            'DataTransaksi' => 'datatransaksi',
            'DataPaket' => $transaksi->datapaket(),
            'DataUser' => $transaksi->datauser(),
            'payperiode' => $paketbarang->datapayperiode(),
            'DataTransaksiCicilan' => '',
            'DataTransaksiLogCicilan' => '',

        ];
        $data['tb_transaksi'] = $transaksi->findAll();
        if ($t_id != null) {
            $transaksi->update($t_id, [
                't_approval_by' => Null
            ]);
---
SELECT *
FROM `tb_transaksi`
UPDATE `tb_transaksi` SET `t_approval_by` = NULL, `waktu` = '2024-06-25 11:09:12'
WHERE `tb_transaksi`.`t_id` IN ('40')

    public function listdatacicilan()
    {
        $UsersModels = new UsersModels();
        $transaksi = new TransaksiModels();
        $paketbarang = new PaketBarangModels();
        $cicilan = new CicilanModels();
        $data = [
            'AdminDashboard' => '',
            'RegisterUser' => '',
            'RegisterSupplier' => '',
            'DataKategoriBarang' => '',
            'DataBarang' => '',
            'DataBarangSupplier' => '',
            'DataPackingBarang' => '',
            'DataKategoriPaket' => '',
            'MenuDataBarang' => '',
            'DataPaketBarang' => '',
            'MenuDataTransaksi' => 'menudatatransaksi',
            'DataPeriodeTransaksi' => '',
            'DataTransaksi' => '',
            'DataPaket' => $cicilan->datapaket(),
            'DataUser' => $cicilan->datauser(),
            'DataPayPeriode' => $cicilan->dataperiode(),
            'DataTransaksiFungsi' => $cicilan->datatransaksi(),
            'DataTransaksiCicilan' => 'datatransaksicicilan',
            'DataTransaksiLogCicilan' => '',
            'NotipDataTransaksi' => $transaksi->get_datatransaksi(),
            'NotipDataUser' => $UsersModels->findAll(),
            'NotipDataPaket' => $transaksi->datapaket(),
        ];
---
SELECT *
FROM `tb_cicilan`
SELECT *
FROM `tb_user`

    public function deletecicilan($c_id)
    {
        $cicilan = new CicilanModels();
        $cicilan->delete($c_id);
---
DELETE FROM `tb_cicilan`
WHERE `c_id` IN ('194')

    public function listdatalogcicilan()
    {
        $UsersModels = new UsersModels();
        $transaksi = new TransaksiModels();
        $logcicilan = new LogCicilanModels();
        $data = [
            'AdminDashboard' => '',
            'RegisterUser' => '',
            'RegisterSupplier' => '',
            'DataKategoriBarang' => '',
            'DataKategoriPaket' => '',
            'DataBarang' => '',
            'DataBarangSupplier' => '',
            'MenuDataBarang' => '',
            'DataPackingBarang' => '',
            'MenuDataTransaksi' => 'menudatatransaksi',
            'DataPeriodeTransaksi' => '',
            'DataPaketBarang' => '',
            'DataTransaksi' => '',
            'DataTransaksiCicilan' => '',
            'DataTransaksiLogCicilan' => 'datatransaksilogcicilan',
            'DataUser' => $logcicilan->datauser(),
            'NotipDataTransaksi' => $transaksi->get_datatransaksi(),
            'NotipDataUser' => $UsersModels->findAll(),
            'NotipDataPaket' => $transaksi->datapaket(),
        ];
---
SELECT *
FROM `tb_log_cicilan`
SELECT *
FROM `tb_user`