app/Controllers/LoginControllers.php

    public function login()
    {
        $db = \Config\Database::connect();
        $post = $this->request->getPost();
        $query = $db->table('tb_user')->getWhere(['u_username' => $post['u_username']]);
        $users = $query->getRow();
---
SELECT *
FROM `tb_user`
WHERE `u_username` = 'adminagen'
SELECT *
FROM `tb_user`
WHERE `u_username` = 'adminagen'
 LIMIT 1